// Частина №1

// Створити скрипт яки повинен виконувати наступне:

//     запитати у користувача рік народження;
//     запитати в нього, в якому місті він живе;
//     запитати його улюблений вид спорту.

// При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:

//     його вік;
//     якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицею якої є місто. Інакше показуємо йому “ти живеш у місті…”, де місце точок – введене місто.

// Частина №2

// Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач вкаже один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати …? і підставляємо на місце точок ім'я та прізвище чемпіона.

// Все це має бути відображено в одному вікні (алерті).

// Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення – “Шкода, що Ви не захотіли ввести свій(ю) …” і вказуємо, що він не захотів вводити – дату народження, місто чи вид спорту .


// let yearBirth = prompt ('enter your year of birth');
// let yourCity = prompt ('enter your city where you live');
// let likeSport = prompt ('enter your favorite sport(бокс, легкая атлетика, футбол)');

// if (yourCity === 'Київ') {
//     alert ('ты живешь в столице Украины');
// } else if (yourCity === 'Вашингтон') {
//     alert ('ты живешь в столице США');
// } else if (yourCity === 'Лондон') {
//     alert ('ты живешь в столице Англии');
// } else if (yourCity === string) {
//     alert (`ты живешь в городе ${yourCity}`);
// } else if (yourCity === null) {
//     alert ('жаль, что не захотел ввести свой город');
// };

// if (likeSport === 'футбол') {
//     alert ('круто! хочешь стать как Криштиану Роналду');
// } else if (likeSport === 'бокс') {
//     alert ('круто! хочешь стать как Теренс Кроуфорд');
// } else if (likeSport === 'легкая атлетика') {
//     alert ('круто! хочешь стать как  Усейн Болт');
// } else if (likeSport === string) {
//     alert (`Рад, что тебе нравится ${likeSport}`);
// } else if (likeSport === null) {
//     alert ('жаль, что ты не захотел ввести свой любимый вид спорта');
// }

// alert (`твоя дата рождения ${yearBirth}, ты живешь в городе ${yourCity}. Твоим любимым ыидом спорта является ${likeSport}`);

const yearBirth = prompt ('enter your year of birth');

const yourCity = prompt('enter your city where you live');
switch (true) {
  case yourCity ==='Киев':
    alert( 'ты живешь в столице Украины');
    break;

  case yourCity === 'Вашингтон':
    alert( 'ты живешь в столице США');
    break;

  case yourCity === 'Лондон':
    alert( 'ты живешь в столице Англии');
    break;

  case yourCity === string:
    alert( `ты живешь в городе + ${yourCity}`);
    break;

  case yourCity === null:
    alert('жаль, что не захотел ввести свой город');
    break;
}