//     Дано масив з елементами різних типів. Створити функцію яка вираховує середнє арифметичне лише числових елементів даного масиву.
let arr = ['a', 2, 'y', '34', 12, 'afaf', 9];

function calculateArr(arr) { // функция с  названием calculate. принимает масив с названием arr
    let sum = 0; // переменная sum, которая изначально равна 0. считать сумму числе
    let count = 0; // переменная count, которая изначально равна 0. Будет считать количество интераций
    
    for (let i = 0; i < arr.length; i++) { // цикл, который перебирает масив arr по его длине
      if (typeof arr[i] === 'number') { //смотрит на условие, если элемент по типу равен number
        sum += arr[i]; // прибавляет число в переменую sum
        count++; // считает количество таких "успешных" интераций
        return sum / count;
      }
    }
    
    // if (count > 0) { // проверка на полодительное число
    //   return sum / count; // если число больше 0, возвращает значение sum(сумма всех чисел) деленное на count(количество интераций)
    // } else {
    //   return 0;
    // }
  }

  let arr2 = calculateArr(arr);
  console.log(arr2); 
  

//     Написати функцію doMath(x, znak, y), яка отримує 3 аргументи: числа x і y, рядок znak. У змінній znak може бути: +, -, *, /, %, ^ (ступінь ).Вивести результат математичної дії, вказаної в змінній znak.Обидва числа і знак виходять від користувача.

function doMath(x, znak, y) {
    let result;
    switch (znak) {
      case '+':
        result = x + y;
        break;
      case '-':
        result = x - y;
        break;
      case '*':
        result = x * y;
        break;
      case '/':
        result = x / y;
        break;
      case '%':
        result = x % y;
        break;
      case '^':
        result = Math.pow(x, y);
        break;
      default:
        result = 'wrong comand';
    }
    return result;
  }

  console.log(doMath(3, '*', 5));

//     Написати функцію заповнення даними користувача двомірного масиву. Довжину основного масиву і внутрішніх масивів задає користувач. Значення всіх елементів всіх масивів задає користувач.


//     Створити функцію, яка прибирає з рядка всі символи, які ми передали другим аргументом. 'func(" hello world", ['l', 'd'])' поверне нам "heo wor". Вихідний рядок та символи для видалення задає користувач.

